app/controllers/school_classes_controller.rb

    def show
        @school_class = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]

    def edit
        @school_class = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]